# Задание 2. Работа с атрибутами класса.
# Добавьте в класс Book атрибут класса library_name = "Главная библиотека".
# Измените его значение на "Центральная библиотека" и выведите для обеих книг.
# 📝 Пример вывода:
# Название библиотеки: Центральная библиотека
# Название библиотеки: Центральная библиотека
class Book:
    book_count = 0
    library_name = "Главная библиотека"

    def __init__(self, title="Неизвестно", author="Неизвестно", pages=0 ):
            self.title = title
            self.author = author
            self.pages = pages
            # Увеличение счётчика книг при каждом создании экземпляра
            Book.book_count += 1

    def display_info(self):
        print(f"Книга: {self.title}, Автор: {self.author}, Страниц: {self.pages}")

    @classmethod
    def change_library(cls, new_name):
        cls.library_name = new_name

book1 = Book(title="1984", author="Джордж Оруэлл", pages=328)
book2 = Book()

Book.change_library("Центральная библиотека")

print(f"Название библиотеки: {book1.library_name}")
print(f"Название библиотеки: {book2.library_name}")
# Вывод:
# Название библиотеки: Центральная библиотека
# Название библиотеки: Центральная библиотека


