# Задание 3. Паттерн Singleton
# Реализуйте класс AppConfig (Singleton) с:
# Настройками {"theme": "Dark", "volume": 80}.
# Методами get_setting(key) и update_setting(key, value).
# Проверка:
# Создайте два объекта AppConfig.
# Измените тему на "Light" через первый объект.
# Выведите тему через второй объект.
# 📝 Пример вывода:
# Тема: Light
# Тема: Light
# Паттерн Singleton через мета класс
class Singleton(type):
    """
    Мета класс Singleton для ограничения создания экземпляров класса.
    Позволяет классу иметь только один экземпляр, создавая общий контекст
    для любых обращений
    """
    _instances = {}

    def __call__(cls, *args, **kwargs):
        """
        При вызове конструктора класса проверяет существование экземпляра.
        Если экземпляр отсутствует, создает новый, иначе возвращает существующий.
        """
        if cls not in cls._instances:
            cls._instances[cls] = super(Singleton, cls).__call__(*args, **kwargs)
        return cls._instances[cls]

# Основной класс конфигурации приложения, реализующий паттерн Singleton
class AppConfig(metaclass=Singleton):
    """
    Класс AppConfig хранит общие настройки приложения и обеспечивает их доступность
    через единый экземпляр, предотвращая повторное создание.
    """
    settings = {"theme": "Dark", "volume": 80}  # Конфигурация по умолчанию

    def get_setting(self, key):
        """
        Получает значение параметра по указанному ключу.
        :param key: Имя ключа настройки
        :return: Значение настройки или None, если ключ не существует
        """
        return self.settings.get(key)

    def update_setting(self, key, value):
        """
        Обновляет значение параметра по указанному ключу.
        :param key: Имя ключа настройки
        :param value: Новое значение для данного ключа
        """
        self.settings[key] = value


# Проверка работоспособности:
config1 = AppConfig()
config2 = AppConfig()

# Меняем тему через первый объект
config1.update_setting("theme", "Light")

# Проверяем снова через первый объект
print(f"Тема: {config1.get_setting('theme')}")  # Тема: Light

# Меняем тему через второй объект
config2.update_setting("theme", "Light")

# Проверяем настройку темы через второй объект
print(f"Тема: {config2.get_setting('theme')}")  # Тема: Light