# Задание 2. Интерфейс Logger.
# Создайте абстрактный класс Logger с методом log(message). Реализуйте класс FileLogger, который выводит:
# Запись в файл: {message}
# Проверка:
# Создайте объект FileLogger.
# Вызовите log("Тест").
# 📝 Пример вывода:
# Запись в файл: Тест
from  abc import ABC, abstractmethod

class Logger(ABC): # Абстрактный интерфейс
     @abstractmethod
     def log(self, message):
         pass

class FileLogger(Logger): # Конкретная реализация
    def log(self, message):
        print(f"Запись в файл: {message}")

logger = FileLogger()
logger.log("Тест")
# Вывод:
# Запись в файл: Тест


