# Middle
#
# Задание 1. Наследование: класс Vehicle и Car
# Создайте класс Vehicle с:
# Защищённым атрибутом _speed = 0.
# Приватным атрибутом __max_speed = 120.
# Методом drive(), который выводит текущую скорость.
# Создайте класс Car, наследующий Vehicle, с:
# Атрибутом brand = "Неизвестно".
# Переопределённым методом drive(), который выводит:
# Машина {brand} движется со скоростью {_speed} км/ч
# Проверка:
# Создайте объект Car с brand="Toyota".
# Вызовите метод drive().
# 📝 Пример вывода:
# Машина Toyota движется со скоростью 0 км/ч
class Vehicle:
    def __init__(self):
        self._speed = 0 # защищенный атрибут
        self.__max_speed = 120 # приватный

    def drive(self):
        print(f"Текущая скорость: {self._speed} км/ч")

class Car(Vehicle): # наследует все свойства и методы родительского класса
    def __init__(self, brand="Неизвестно"):
        super().__init__()
        self.brand = brand

    def drive(self):
        print(f"Машина {self.brand} движется со скоростью {self._speed} км/ч")

car = Car(brand="Toyota")
car.drive()
# Вывод:
# Машина Toyota движется со скоростью 0 км/ч


