# Задание 3. Полиморфизм: класс Bicycle.
# Создайте класс Bicycle, наследующий Vehicle, с переопределённым методом drive():
# Велосипед движется со скоростью {_speed} км/ч
# Проверка:
# Создайте список [Car(brand="Toyota"), Bicycle()].
# Для каждого объекта вызовите drive().
# 📝 Пример вывода:
# Машина Toyota движется со скоростью 0 км/ч
# Велосипед движется со скоростью 0 км/ч
class Vehicle:
    def __init__(self):
        self._speed = 0 # защищенный атрибут
        self.__max_speed = 120 # приватный

    def drive(self):
        print(f"Текущая скорость: {self._speed} км/ч")

    def get_max_speed(self):
        return self.__max_speed

    def set_max_speed(self, new_speed):
        if new_speed > 0:
            self.__max_speed = new_speed

class Car(Vehicle): # наследует все свойства и методы родительского класса
    def __init__(self, brand="Неизвестно"):
        super().__init__()
        self.brand = brand

    def drive(self):
        print(f"Машина {self.brand} движется со скоростью {self._speed} км/ч")

class Bicycle(Vehicle):
    def drive(self):
        print(f"Велосипед движется со скоростью {self._speed} км/ч")
# проверка
vehicles = [
    Car(brand="Toyota"),
    Bicycle()
]

for vehicle in vehicles:
    vehicle.drive()
# Вывод:
# Машина Toyota движется со скоростью 0 км/ч
# Велосипед движется со скоростью 0 км/ч


